# 基本擴展
ms-python.python
esbenp.prettier-vscode
dbaeumer.vscode-eslint

# 開發工具
eamodio.gitlens
ms-azuretools.vscode-docker

# 語言支持
MS-CEINTL.vscode-language-pack-zh-hant
ms-vscode.cpptools

# 其他工具
shd101wyy.markdown-preview-enhanced
humao.rest-client
ms-toolsai.jupyter
lightyen.vscode-fanhuaji
codeium.codeium
