#!/usr/bin/env bash
set -euo pipefail

# 更新 Cloudflare IPv4 真實 IP
/bin/curl -s https://www.cloudflare.com/ips-v4 \
  | /bin/awk '{print "set_real_ip_from " $1 ";"}' \
  > /etc/nginx/geoip/cloudflare_v4_realip.conf

# 更新 Cloudflare IPv6 真實 IP
/bin/curl -s https://www.cloudflare.com/ips-v6 \
  | /bin/awk '{print "set_real_ip_from " $1 ";"}' \
  > /etc/nginx/geoip/cloudflare_v6_realip.conf

|  |  |  |  |  |  |  |  |
|----|----|----|----|----|----|----|----|
|  |  | 113 | 年 |  | 度 112 | 年 | 度 |
| 项目 |  | 附注 | 金 | 额 | % 金 | 额 | % |
| 4000 | 營業收入 | 六(十七)及七 | \$ | 142,230 | 100 \$ | 145,551 | 100 |
| 5000 | 營業成本 | 六(二十二)及七( |  | 82,940)( | 59）（ | 91,501)（ | 63\) |
| 5900 | 營業毛利 |  |  | 59,290 | 41 | 54,050 | 37 |
|  | 營業费用 | 六(二十二) |  |  |  |  |  |
| 6100 | 推銷费用 | （ |  | 4,312)( | 3）（ | 2,826)( | 2\) |
| 6200 | 管理费用 |  |  | 13,111) ( | 9）（ | 17,074) ( | 12\) |
| 6000 | 營業費用合計 |  |  | 17,423)（ | 12）( | 19,900)（ | 14\) |
| 6900 | 營業利益 |  |  | 41,867 | 29 | 34,150 | 23 |
|  | 營業外收入及支出 |  |  |  |  |  |  |
| 7100 | 利息收入 | 六(十八) |  | 1,512 | 1 | 875 | 1 |
| 7010 | 其他收入 | 六(十九)及七 |  | 3,123 | 2 | 2,422 | 2 |
| 7020 | 其他利益及損失 | 六(二十) （ |  | 226\) | ■ | 1,081 | 1 |
| 7050 | 财務成本 | 六(二十一)及七( |  | 534\) | 1 | 729)（ | 1\) |
| 7070 | 採用權益法認列之子公司、關 |  |  |  |  |  |  |
| 7000 | 聯企業及合資損益之份額 |  |  | 31,609 | 22 | 58,167 | 40 |
| 7900 | 營業外收入及支出合計 |  |  | 35,484 | 25 | 61,816 | 43 |
| 7950 | 税前淨利 | 六(二十四) |  | 77,351 | 54 | 95,966 | 66 |
| 8000 | 所得税费用 |  |  | 15,882)( | 11)（ | 21,563)（ | 15\) |
| 8200 | 繼續營業單位本期淨利 |  | \$ | 61,469 | 43 | 74,403 | 51 |
|  | 本期淨利 其他綜合損益 |  |  | 61,469 | 43 \$ | 74,403 | 51 |
| 8316 | 不重分類至損益之項目 |  |  |  |  |  |  |
|  | 透過其他綜合損益按公允價值 六(二) |  |  |  |  |  |  |
|  | 衡量之權益工具投資未實現評 |  |  |  |  |  |  |
|  | 價損益 不重分類至損益之項目總額 | (\$ | 25） |  | (\$ | 148\) | 1 |
|  | 後續可能重分類至損益之項目 |  |  | 25\) |  | 148\) |  |
| 8361 | 國外營運機構财務報表换算之 |  |  |  |  |  |  |
| 8399 | 兌換差額 |  |  | 4,485 | 3（ | 925\) |  |
|  | 與可能重分類之項目相關之所 六(二十四) |  |  |  |  |  |  |
| 得税 |  |  | 1,143) |  |  | 185 |  |
| 8360 | 後續可能重分類至損益之項 |  |  |  |  |  |  |
|  | 目總額 |  |  | 3,342 | 3( | 740\) |  |
|  | 其他綜合損益(淨額) | \$ | 3,317 |  |  | 888\) |  |
| 8300 8500 | 本期綜合損益總額 |  | \$ | 64,786 | 3(\$ 46 \$ | 73,515 | 51 |
|  | 淨利歸屬於： |  |  |  |  |  |  |
|  | 綜合損益總額歸屬於： |  |  |  |  |  |  |
| 9750 | 基本每股盈餘 | 六(二十四) |  |  |  |  |  |
|  | 基本每股盈餘合計 |  | \$ |  | 4.13 \$ |  | 5.00 |
|  | 稀釋每股盈餘 | 六(二十四) |  |  |  |  |  |
| 9850 | 稀釋每股盈餘合計 |  | \$ |  | 4.10 \$ |  | 4.97 |